In [1]:
import numpy as np
import pandas as pd

In [2]:
n = np.array([1, 2, 3, 4, 40])

In [3]:
x = pd.Series(n)

In [4]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [5]:
type(x)

pandas.core.series.Series

In [6]:
b = pd.Series([1, 2, [11, 10], 33, [12, 23], 47, 58, 100])

In [7]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [8]:
b[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [9]:
b[2]

[11, 10]

In [10]:
s2 = pd.Series([12,52,12,52,10,23,42,10,23])

In [11]:
s2

0    12
1    52
2    12
3    52
4    10
5    23
6    42
7    10
8    23
dtype: int64

In [12]:
s2.value_counts()

12    2
52    2
10    2
23    2
42    1
dtype: int64

In [13]:
s2.argmax()

1

In [14]:
s2.argmin()

4

# Data Frame

In [15]:
a = pd.DataFrame()

In [16]:
b = pd.DataFrame([1,2,55,40,86])

In [17]:
a

Empty DataFrame
Columns: []
Index: []

In [18]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [19]:
type(b)

pandas.core.frame.DataFrame

In [20]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [21]:
c = pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [22]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [23]:
d = pd.DataFrame([[1,2,3,4,5],[10,20,30,40,50],[5,10,15,20,25],[5,4,3,2,1],[11,22,33,44,55]])

In [24]:
d

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   5  10  15  20  25
3   5   4   3   2   1
4  11  22  33  44  55

In [25]:
d.head()

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   5  10  15  20  25
3   5   4   3   2   1
4  11  22  33  44  55

In [26]:
e = pd.DataFrame([[1,2,3,4,5],[10,20,30,40,50],[5,10,15,20,25],[5,4,3,2,1],[11,22,33,44,55],[10,10,10,10,10]])

In [27]:
e

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   5  10  15  20  25
3   5   4   3   2   1
4  11  22  33  44  55
5  10  10  10  10  10

In [28]:
e.head()

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   5  10  15  20  25
3   5   4   3   2   1
4  11  22  33  44  55

In [29]:
e.tail()

    0   1   2   3   4
1  10  20  30  40  50
2   5  10  15  20  25
3   5   4   3   2   1
4  11  22  33  44  55
5  10  10  10  10  10

In [30]:
e.sample(5)

    0   1   2   3   4
3   5   4   3   2   1
2   5  10  15  20  25
5  10  10  10  10  10
0   1   2   3   4   5
1  10  20  30  40  50

In [31]:
e = pd.DataFrame([[1,2,3,4],[10,20,30,40,50],[5,10,15,20,25],[5,'Missing',3,2],[11,22,33,44,55],[10,10,10,10,10]], columns = ['colA', 'colB', 'colC', 'colD', 'colE'])

In [32]:
e

   colA     colB  colC  colD  colE
0     1        2     3     4   NaN
1    10       20    30    40  50.0
2     5       10    15    20  25.0
3     5  Missing     3     2   NaN
4    11       22    33    44  55.0
5    10       10    10    10  10.0

In [33]:
c1 = pd.DataFrame([[1,2,3,4],[10,20,30,40,50],[5,10,15,20,25],[5,'Missing',3,2],[11,22,33,44,55],[10,10,10,10,10]], columns = ['colA', 'colB', 'colC', 'colD', 'colE'])

In [34]:
c1

   colA     colB  colC  colD  colE
0     1        2     3     4   NaN
1    10       20    30    40  50.0
2     5       10    15    20  25.0
3     5  Missing     3     2   NaN
4    11       22    33    44  55.0
5    10       10    10    10  10.0

In [35]:
c1['colB']

0          2
1         20
2         10
3    Missing
4         22
5         10
Name: colB, dtype: object

In [36]:
c1[['colB', 'colC']]

      colB  colC
0        2     3
1       20    30
2       10    15
3  Missing     3
4       22    33
5       10    10

In [37]:
c1[0:3]['colA']

0     1
1    10
2     5
Name: colA, dtype: int64

In [38]:
c1[0:3][['colA', 'colB']]

   colA colB
0     1    2
1    10   20
2     5   10

In [39]:
c1[['colA', 'colB']][0:3]

   colA colB
0     1    2
1    10   20
2     5   10

In [40]:
c1['new_col'] = [12,45,77,44,88,20]

In [41]:
c1

   colA     colB  colC  colD  colE  new_col
0     1        2     3     4   NaN       12
1    10       20    30    40  50.0       45
2     5       10    15    20  25.0       77
3     5  Missing     3     2   NaN       44
4    11       22    33    44  55.0       88
5    10       10    10    10  10.0       20

In [42]:
c1['colD'].max()

44

In [43]:
c1['new_col2'] = [10,20,30,40,50,60]

In [44]:
c1

   colA     colB  colC  colD  colE  new_col  new_col2
0     1        2     3     4   NaN       12        10
1    10       20    30    40  50.0       45        20
2     5       10    15    20  25.0       77        30
3     5  Missing     3     2   NaN       44        40
4    11       22    33    44  55.0       88        50
5    10       10    10    10  10.0       20        60

In [45]:
c1['colB'] = c1['new_col'] + c1['new_col2']

In [46]:
c1

   colA  colB  colC  colD  colE  new_col  new_col2
0     1    22     3     4   NaN       12        10
1    10    65    30    40  50.0       45        20
2     5   107    15    20  25.0       77        30
3     5    84     3     2   NaN       44        40
4    11   138    33    44  55.0       88        50
5    10    80    10    10  10.0       20        60

In [47]:
c1['colB'] > 50

0    False
1     True
2     True
3     True
4     True
5     True
Name: colB, dtype: bool

In [48]:
f = c1['colB'] > 50

In [49]:
c1[f]

   colA  colB  colC  colD  colE  new_col  new_col2
1    10    65    30    40  50.0       45        20
2     5   107    15    20  25.0       77        30
3     5    84     3     2   NaN       44        40
4    11   138    33    44  55.0       88        50
5    10    80    10    10  10.0       20        60